import { decipher } from '.';

const source = `
19  ჾᲢᲒᲔᲢ.  ᲓᲧᲥᲐᲦჿᲡ  ᲮᲕᲙᲚᲫᲬ  ᲦᲧჿᲞ  ჾᲐᲧᲬ ᲩᲫᲪჿᲫ.  ᲚᲢᲥ  ᲪᲢ  ᲚᲢᲥᲐჾ  Ს  ᲚᲨᲮ  Ჭ  ᲓᲤᲐᲧჾᲕ ᲤᲧᲮᲫᲙᲢᲬᲚᲧჾᲕ  ᲔᲒᲫᲕჾᲖᲕ,  Ჭ  ᲐᲔᲭᲒᲝᲔᲫᲠ, ᲭᲐᲔᲐᲒᲐᲧ  ᲑᲧᲒᲧᲤᲧᲒჿᲨᲔ  ᲩᲫᲪჿᲞ  ᲭᲢᲩᲦᲐᲥᲐ ᲙᲧᲮᲐᲤᲧᲭᲢ  ჿᲢ  ᲑᲮᲢჿᲧᲔᲧ.  ᲫჾᲡ  ᲑᲢᲖჿᲕᲔᲫᲡ ᲭᲐᲚᲧᲙᲭᲫჿᲢ  ᲤᲓᲔᲢჿᲧᲔ  Ფ  ᲐᲦᲫჿ  ᲒᲡᲦ  Დ ᲫჾᲧჿᲢჾᲫ  ᲟᲬჿᲚᲔᲧᲬჿᲢ,  ჿᲞᲠᲔᲐჿᲢ  Ძ ᲮᲧᲐჿᲢᲒᲦᲐ.  ᲔᲧᲑᲧᲒᲞ  ᲦᲧᲮᲐ  ᲪᲢ  ჾᲢᲮᲝჾ - ᲑᲐᲭᲫჿᲕᲔᲞ  ᲕᲠᲔჿᲝᲬ  ჿᲫᲩჿᲫᲬ  ჿᲐᲤᲥᲐᲒᲐᲦ,   ᲐᲔᲑᲒᲢᲤᲫᲔᲞᲓᲡ  Ფ  ᲓᲔᲐᲮᲫᲘᲕ  Ძ  ᲒᲢᲓᲓᲭᲢᲪᲢᲔᲞ  ᲟᲔᲫჾ  ᲣᲧᲪჾᲐᲪᲥᲮᲝჾ  ᲙᲫჿᲐᲤჿᲫᲭᲢჾ  ᲐᲔ  ჿᲢᲕᲭᲫ  Ძ  ᲔᲕᲑᲐᲤᲢᲔᲝჾ  ᲥᲧჿᲧᲒᲢᲮᲢჾ  Ა  ჾᲐᲨჾ  ᲐᲔᲭᲒᲝᲔᲫᲫ. ᲑᲒᲧᲦᲓᲔᲢᲤᲮᲡᲠ,  ᲭᲢᲭ  ᲐჿᲫ  ᲣᲕᲦᲕᲔ  ᲕჿᲫᲩᲧჿჿᲐ ᲑᲒᲐᲓᲫᲔᲞ  ᲑᲒᲐᲛᲧჿᲫᲡ  ᲪᲢ  ᲤᲓᲧ  ᲔᲧ  ᲐᲣᲫᲦᲝ, ᲭᲐᲔᲐᲒᲝᲧ  ჾჿᲧ  ᲑᲒᲫᲙᲫჿᲫᲮᲫ  Ძ  ᲪᲢᲤᲫᲦᲐᲤᲢᲔᲞ ᲓᲐ  ᲓᲔᲒᲢᲚჿᲐᲬ  ᲓᲫᲮᲐᲬ.  ჿᲢᲤᲧᲒჿᲡᲭᲢ  ᲐჿᲫ  ᲪᲢᲗᲐᲔᲡᲔ  ᲐᲔჿᲡᲔᲞ  ჾᲐᲠ  ᲓᲮᲢᲤᲕ.  ᲔᲧᲑᲧᲒᲞ  ჾᲐᲫ  ჾᲝᲓᲮᲫ  ᲦᲐᲮᲩჿᲝ  ᲣᲝᲔᲞ  ᲪᲢᲛᲫᲛᲧჿᲝ ᲚᲫᲖᲒᲐჾ  Ძ  ᲑᲢᲒᲐᲮᲧჾ.  Ტ  ᲮᲕᲙᲚᲧᲬ  ᲪᲢᲛᲫᲔᲐᲬ  ᲓᲮᲧᲦᲕᲠᲛᲧᲬ  ᲪᲢᲑᲫᲓᲫ  ᲓᲔᲢჿᲧᲔ  ჾᲐᲡ  ᲖᲢჾᲫᲮᲫᲡ.
`;

const decoder = [{ ჾ: 'м' }, { Ტ: 'а' }, { Გ: 'р' }, { Ე: 'т' }];

console.log(decipher(decoder, source));
